; Отладка в Bochs
macro brk { xchg bx, bx}

; ----------------------------------------------------------------------------------------------------------------------
; МАКРОСЫ ДЕСКРИПТОРОВ
; ----------------------------------------------------------------------------------------------------------------------

macro DESCRIPTOR address32, limit24, config
{
    dd address32
    dd limit24
    dw config
}

macro DESCRIPTOR_LDT address32, limit24, config
{
    dw (limit24 AND 0xFFFF)
    dw (address32 AND 0x00FFFF)            ; Биты адреса 0..15
    db ((address32 AND 0xFFFF00) shr 8)    ; Биты адреса 16..23
    db (config OR 0x02) ; DPL=0, P=0         ; Бит 1 выставлен в 1, остальное настраивается
    dw ((limit24 AND 0x0F0000) shr 8)      ; Биты предела 16..19. Верхние биты конфига зарезервированы
    db ((address32 AND 0xFF000000) shr 24) ; Биты адреса 24..31
}

; Структура шлюза задачи

;   63                  48  47  46 45  44      40  39  37 36     32
; +-----------------------+---+------+-----------+-------+---------+
; |                       | P | DPL  | 0 D 1 0 1 |                 |
; +-----------------------+---+------+-----------+-------+---------+
; 
;   31                  16 15                                     0
; +-----------------------+----------------------------------------+
; | Селектор TSS          |                                        |
; +-----------------------+----------------------------------------+

macro GATE_TASK tss_selector
{
    dw 0
    dw tss_selector
    db 0
    db 10000101b ; Present, DPL=0
    dw 0
}

; Структура шлюза прерывания

;   63                  48  47  46 45  44      40  39  37 36     32
; +-----------------------+---+------+-----------+-------+---------+
; | Смещение, биты 16..31 | P | DPL  | 0 D 1 1 0 | 0 0 0 |         |
; +-----------------------+---+------+-----------+-------+---------+
; 
;   31                  16 15                                     0
; +-----------------------+----------------------------------------+
; | Селектор сегмента     | Смещение, биты 0..15                   |
; +-----------------------+----------------------------------------+

macro GATE_INTERRUPT address32, selector
{
    dw (address32 and 0xFFFF)
    dw selector
    db 0
    db 10001110b ; Present, DPL=0, DefaultSize=32 bit
    dw ((address32 and 0xFFFF0000) shr 16)
}

; Структура шлюза ловушки

;   63                  48  47  46 45  44      40  39  37 36     32
; +-----------------------+---+------+-----------+-------+---------+
; | Смещение, биты 16..31 | P | DPL  | 0 D 1 1 1 | 0 0 0 |         |
; +-----------------------+---+------+-----------+-------+---------+
; 
;   31                  16 15                                     0
; +-----------------------+----------------------------------------+
; | Селектор сегмента     | Смещение, биты 0..15                   |
; +-----------------------+----------------------------------------+

macro GATE_TRAP address32, selector
{
    dw (address32 AND 65535)
    dw selector
    db 0
    db 10001111b ; Present, DPL=0, DefaultSize=32 bit
    dw ((address32 and 0xFFFF0000) shr 16)
}

; Структура компонента
macro COM_BASIC com_id, x, y, w, h 
{
    dw x, y, w, h
    dw com_id
}
