
// Хранение данных о прорисовываемых пикселях (300 кб памяти)
uint8_t* canvas; 

// Хранение информации о курсоре для печати символов
struct Tcursor {
    
    // Положение
    int     x, y;
    
    // Цвета и шрифты
    char    frcolor;
    char    bgcolor;        // =-1 Прозрачный
    char    font;           // =0 8x16 Mono; =1 Tahoma 12pt

    // Границы, в которых движется курсор
    int     border_top;
    int     border_right;
    int     border_bottom;
    int     border_left;
    
    // Для печати символов
    int     max_chars;
    
    // Позиция мыши
    int     mouse_x;
    int     mouse_y;
    int     mouse_show;
    
};

struct Tcursor cursor;

// Бинарная иконка мыши
// 11 - Черный; 10 - Белый
static const uint32_t mouse_icon[21] = {

    0b110000000000000000000000,
    0b111100000000000000000000,
    0b110111000000000000000000,
    0b111001110000000000000000,
    0b111010011100000000000000,
    0b111010100111000000000000,
    0b111010101001110000000000,
    0b111010101010011100000000,
    0b111010101010100111000000,
    0b111010101010101001110000,
    0b111010101010101010011100,
    0b111010101010101111111111,
    0b111010101110101100000000,
    0b111010111110101100000000,
    0b111011000011101011000000,
    0b111100000011101011000000,
    0b110000000000111010110000,
    0b000000000000111010110000,
    0b000000000000001110101100,
    0b000000000000001110101100,
    0b000000000000000011110000
};
