<?php

$s = file_get_contents('kernel.bin');
$size = strlen($s);

$sum = 1;
$start = 0;
$pivot = ord($s[0]);

// ----------------------------------------------
// Сборка данных
// ----------------------------------------------

for ($i = 1; $i < $size; $i++) {

    $c = ord($s[$i]);

    // Есть повторы с предыдущим символом
    if ($c == $pivot) {
        $sum++;
    }
    else {

        // Оборвался повтор, и получено 3 или более повторяющихся символов
        if ($sum > 2) {

            // Добавить строку перед повторами, если она есть
            $plen = ($i - $sum) - $start;
            if ($plen > 0) $out[] = "I|$plen|".substr($s,$start,$plen);

            // Добавить сами повторы
            $out[] = "R|$sum|" . chr($pivot);

            // Новое начало
            $start = $i;
        }

        // Обновить символ для сверки повторов
        $pivot = $c;
        $sum = 1;
    }
}

// ----------------------------------------------
// Выдача остатка
// ----------------------------------------------

// Остаточная строка имеет повтор
if ($sum > 2) {

    // Добавить остаточную строку для Insert
    $plen = ($i - $sum) - $start;
    if ($plen) $out[] = "I|$plen|".substr($s,$start,$plen);

    // Сами повторы
    $out[] = "R|$sum|$pivot";
    $start = $i;

} else {

    // В конце 1 или 2 повтора символа - выдача остатка, как есть
    $plen = $i - $start;
    if ($plen) $out[] = "I|$plen|".substr($s,$start);
}

$out[] = "I|0|";

// ----------------------------------------------
// Запись в файл
// ----------------------------------------------

$f = fopen("kernel.rle", "wb+");
foreach ($out as $item) {

    list($type, $num, $chars) = explode('|', $item, 3);

    // Как есть, выдать до 127 байт
    if ($num < 128) {

         fwrite($f, chr($type == 'I' ? $num : (0x80 | $num)) . $chars);

    } else {

        for ($i = 0; $i < $num; $i += 127) {

            // Повторы
            if ($type == 'R') {

                $l = $num - $i;
                $l = $l > 127 ? 127 : $l;
                fwrite($f, chr($l | 0x80) . $chars);

            // Вставки
            } else {

                $m = substr($chars, $i, 127);
                $l = strlen($m);
                fwrite($f, chr($l) . $m);
            }

        }

    }

}

fclose($f);