; ***********************************************************
; ИНТЕРПРЕТАТОР БЕЙСИК ДЛЯ FPGA i80186
; --------------
;  6KB RAM
;  4KB FONTROM
;  4KB VIDEORAM
; 32KB ROMCODE 
; --------------
; 46KB ON-CHIP MEMORY
; ***********************************************************
; COMPILE AS: sh make.sh
; ***********************************************************
; [$0000-$03FF] IVT
; [$0400-$07FF] BIOS Data
; [$0800-$17FF] Data

    org 0x0000

    macro brk { xchg bx,bx }

; -------------------------------------------
; ОСНОВНАЯ ПРОГРАММА / BASIC
; -------------------------------------------

_program_start:
brk

    mov     ax, 0x0000
    mov     ds, ax
    mov     es, ax
    mov     ss, ax
    mov     sp, 0x1800      ; Установка в область 6 кб оперативной памяти / BIOS
    
    mov     ax, 0xB800
    mov     es, ax          ; Для вывода на экран

    ; Полная очистка экрана 
    mov     di, 0x0000
    mov     ax, 0x1720
    mov     cx, 80 * 25
    rep     stosw
    
    ; Выдача на экран все
    call    screen_reload    

    jmp $

; -------------------------------------------
; БИБЛИОТЕКИ КОДА
; -------------------------------------------

    include "libs/screen.asm"

; -------------------------------------------
; СТРОКОВЫЕ ДАННЫЕ И ПРОСТО ДАННЫЕ О ПРОГРАММЕ
; -------------------------------------------

    ; Заполнить оставшееся место нулями
    times   7FF0h - $ db 0
    
    ; Эмуляция BIOS-перехода 
    jmp     _program_start    
    times   8000h - $ db 0x90
