;
; Обработчик нажатий на клавиатуру
;

; ----------------------------------------------------------------------
; Сам обработчик

dev.ISRKeyboard:
brk
        push    ebx edx ecx eax
        
        ; Принять полученный скан-код с порта
        in      al, 60h
        
        ; Если (ScanCode & 0x80) == 0, значит клавиша нажата
        test    al, 80h
        mov     ah, $FF
        je      @f
        mov     ah, $00
@@:     mov     bl, al
        and     ebx, 7Fh
        mov     [KEYBOARD_STATE + ebx], ah      ; Сохранить статус клавиш
        
        ; Записать в клавиатурный буфер            
        
        ; Отправка EOI (End Of Interrupt) на Master
        mov     al, PIC_EOI
        out     PIC1, al
        pop     eax ecx edx ebx
        iret

; ----------------------------------------------------------------------

; Scan -> ASCII в нижнем регистре
dev.KeyboardScanToASCII:

        ;   0    1    2    3     4    5    6    7    8     9    A    B     C    D   E   F
        db  0,   27,  '1', '2', '3', '4', '5', '6', '7',  '8', '9', '0',  '-', '=', 8,  9        
        db  'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o',  'p', '[', ']',  10,  0,  'a', 's'  ; 10
        db  'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', 0x27, '`', 0,   0x5C, 'z', 'x','c', 'v'  ; 20
        db  'b', 'n', 'm', ',', '.', '/', 0,   '*', 0,    ' ', 0,   0,    0,    0, 0,   0    ; 30
        db  0,   0,   0,   0,   0,   1,   0,   0,   0,    0,   '-', 0,    0,    0, '+', 0    ; 40
        db  0,   0,   0,   0,   0,   0,   0,   0,   0,    0,   0,   0,    0,    0, 0,   0    ; 50
        db  0,   0,   0,   0,   0,   0,   0,   0,   0,    0,   0,   0,    0                  ; 60

; Scan -> ASCII в верхнем регистре
dev.KeyboardScanToASCIIWithShift:

        ;   0    1    2    3     4    5    6    7    8    9    A    B    C    D   E   F 
        db  0,  255, '!', '@',  '#', '$', '%', '^', '&', '*', '(', ')', '_', '+', 8,  9      ; 00
        db 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', 10,   0, 'A','S'      ; 10
        db 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"',  '~', 0,  '|', 'Z', 'X','C','V'      ; 20
        db 'B', 'N', 'M', '<', '>', '?',  0,  '*',  0,   ' ', 0,   0,   0,   0,  0,  0       ; 30
        db  0,   0,   0,   0,   0,   1,   0,   0,   0,    0, '-',  0,   0,   0, '+', 0       ; 40
        db  0,   0,   0,   0,   0,   0,   0,   0,   0,    0,  0,   0,   0,   0,  0,  0       ; 50
        db  0,   0,   0,   0,   0,   0,   0,   0,   0,    0,  0,   0,   0                    ; 60
