/*
 * Системный менеджер файлов
 * ---------------------------------
 */

// Опрос приложения из основного цикла системы
void app_commander() {

    /*

    // получить все события для окна
    while (event_id = sys_get_event(app_id)) {

        // event_id = UPDATE -- вызывается при переключении на окно, а также при его создании, перемещении
        // event_id = KEYB   -- при нажатии на кнопку (и отпускании тоже), если фокус на текущем окне
        // event_id = CREATE -- только что созданное новое окно
        // event_id = TIMER  -- каждые 1/100 секунд вызывать таймер для окон

        // нарисовать панельки
        // ждать нажатия кнопок
        // для вывода информации использовать специально обученный syscall (putpixel и прочие пирроги)

    }

    */


}