; ----------------------------------------------------------------------
; Сохранить/загрузить векторы прерывания
; ----------------------------------------------------------------------

save_rmidt: ; Сохранение старых

        mov     esi, $00000000
        mov     edi, $00000800
        mov     ecx, $800 shr 2
        rep     movsd
        ret

save_pmidt: ; Сохранение новых

        mov     esi, $00000000
        mov     edi, $00003000
        mov     ecx, $800 shr 2
        rep     movsd
        ret

load_rmidt: ; Загрузка старых

        ret

load_pmidt: ; Загрузка новых

        ret
