; ----------------------------------------------------------------------
; Загрузочный сектор

; http://bochs.sourceforge.net/doc/docbook/user/diskimagehowto.html как создать диск
; fasm boot.asm && dd conv=notrunc if=boot.bin of=disk.img bs=512 count=1
; bs=446 для реальной флешки
; ----------------------------------------------------------------------

DISK_DRIVE_DL EQU 0x7BFE

    org 0x7c00       

    macro brk { xchg bx, bx }

    ; Отключение I=0, D=0
    cli
    cld

    ; Перенести SS:SP в безопасное место
    mov     ax, 0x0000
    mov     ss, ax
    mov     sp, 0x7C00

    ; Загрузить сектор в память (HMA)
    mov     ah, 0x42
    mov     si, DAP
    int     0x13 

    ; Убрать курсор за экран
    mov     ah, 02h
    mov     bh, 0
    mov     dx, 0x2000
    int     0x10    

    ; И перейти к программе
    jmp 0x0800 : 0x0000

; ЧИТАТЬ ИЗ DAP
; ----------------------------------------------------------------------

DAP:

    dw 0x0010  ; 0 | размер DAP = 16
    dw 0x0040  ; 2 | читать 64 сектора (32кб)
    dw 0x0000  ; 4 | смещение (=0)
    dw 0x0800  ; 6 | сегмент  (=800h) * 10h = 0000:8000)
    dq 1       ; 8 | номер сектора от 0 до N-1 (со второго сектора)

    ; Заполнить нулями
    times 7c00h + (512 - 2 - 64) - $ db 0

    ; Информация о 4 разделах
    times 64 db 0

    ; Сигнатура
    dw 0xAA55
