
; ----------------------------------------------------------------------
; Системные переменные
; ----------------------------------------------------------------------

bios_disk_boot      db 0        ; С какого диска загружен сектор?
pentium             db 0        ; Если тут =1 то это Pentium+ процессор
irq_timer_counter   dd 0        ; Таймер
dynamic             dd 0        ; Динамическая память

; ----------------------------------------------------------------------
term:                           ; Терминал
; ----------------------------------------------------------------------

.cache              dd 0        ; Ссылка на память 4кб
.x                  db 0        ; Положение курсора по (X=0..79, Y=0..24)
.y                  db 0

; ----------------------------------------------------------------------
fdc:                            ; Контроллер флоппи-диска
; ----------------------------------------------------------------------

    ; результат
    .st0            db 0        ; Статусный регистр 0
    .st1            db 0
    .st2            db 0
    .cyl            db 0
    .head_end       db 0
    .head_start     db 0

    ; функционирование
    .motor          db 0        ; Включен ли мотор
    .motor_time     dd 0        ; Время включения мотора
    .func           db 0        ; Функция запроса на IRQ
    .ready          db 0        ; IRQ обработан
    .error          db 0        ; Ошибка исполнения

    ; запрос
    .lba            dw 0
    .r_hd           db 0        ; * головка
    .r_cyl          db 0        ; * цилиндр
    .r_sec          db 0        ; * сектор


; ----------------------------------------------------------------------
ps2:                            ; Интерфейс PS/2 для мыши
; ----------------------------------------------------------------------

.cmd            db 0            ; принятая команда от мыши
.dat_x          db 0            ; x = -128..127
.dat_y          db 0            ; y = -128..127


; ----------------------------------------------------------------------
ata:                            ; ATA интерфейс
; ----------------------------------------------------------------------

.base           dw 0            ; pri=1F0, sec=170
.slave          db 0            ; master=0, slave=1
.lba            dd 0            ; запрошенный lba
.count          dw 0            ; запрошенный count
.error          db 0            ; =0 ошибок нет
.types          db 0, 0, 0, 0   ; ata[4] типы
.identify       dd 0, 0, 0, 0   ; ссылки на identify
