; ----------------------------------------------------------------------
; Загрузочный сектор
; fasm boot.asm && dd conv=notrunc if=boot.bin of=../c.img bs=446 count=1
; ----------------------------------------------------------------------

DISK_DRIVE_DL EQU 0x7BFE

        org 0x7c00
        
        macro brk { xchg bx, bx }

        ; Отключение I=0, D=0
        cli
        cld
        
        ; Загрузка ~64кб (65024 байт)
        ; Загрузить программу сразу в HMA
        mov bp, 128
        mov sp, 0x7c00
        
reading:
        
        ; Загрузить сектор в память (HMA)
        mov ah, 0x42
        mov si, DAP
        int 0x13 
        
        add word [DAP + 6], 0x20
        inc word [DAP + 8]
        dec bp
        jne reading

        ; И перейти к программе
        jmp 0x0000 : 0x8000

; ЧИТАТЬ ИЗ DAP
; ----------------------------------------------------------------------

DAP:    dw 0x0010  ; 0 | размер DAP = 16
        dw 0x0001  ; 2 | читать 1 сектор (512 байт)
        dw 0x0000  ; 4 | смещение (=0)
        dw 0x0800  ; 6 | сегмент  (=800h) * 10h = 0000:8000)
        dq 1       ; 8 | номер сектора от 0 до N-1 (со второго сектора)

        times 7c00h + (512 - 2 - 64) - $ db 0
